export const TERMS_OF_SERVICE_HTML = `
<style>
  h2 { text-align: center; }
  h3 { margin-top: 20px; }
  ul { margin-top: 10px; }
  li { margin-left: 20px; margin-bottom: 5px; }
  p { line-height: 1.5; }
</style>

<h2>서비스 이용약관</h2>

<h3>제1조(목적)</h3>
<p>
  본 약관은 신한금융희망재단(이하 "회사")이 제공하는 공간 예약 서비스 및 관련 제반 서비스(이하 "서비스")의 이용과 관련하여 회사와 회원 간의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.
</p>

<h3>제2조(용어의 정의)</h3>
<ul>
  <li>"서비스"라 함은 회사가 구현된 단말기(PC, 휴대형 단말기 등의 각종 유무선 장치를 포함)와 상관없이 회원이 이용할 수 있는 공간 예약 서비스 및 관련 제반 서비스를 의미합니다.</li>
  <li>"회원"이라 함은 회사의 서비스에 접속하여 본 약관에 따라 회사와 이용계약을 체결하고 회사가 제공하는 서비스를 이용하는 고객을 말합니다.</li>
  <li>"아이디(ID)"라 함은 회원의 식별과 서비스 이용을 위하여 회원이 정하고 회사가 승인하는 문자와 숫자의 조합을 의미합니다.</li>
</ul>

<h3>제3조(약관의 효력 및 변경)</h3>
<ol>
  <li>본 약관은 서비스를 이용하고자 하는 모든 회원에 대하여 그 효력을 발생합니다.</li>
  <li>회사는 이 약관의 내용을 회원이 쉽게 알 수 있도록 서비스 화면에 게시합니다.</li>
  <li>회사는 「약관의 규제에 관한 법률」, 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 등 관련 법령을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.</li>
  <li>회사가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행 약관과 함께 제2항의 방식에 따라 그 적용일자 7일 전부터 적용일자 전일까지 공지합니다. 다만, 회원에게 불리한 내용으로 변경하는 경우에는 최소 30일 이전에 공지합니다.</li>
</ol>

<h3>제4조(서비스의 제공 및 변경)</h3>
<ol>
  <li>회사는 회원에게 다음과 같은 서비스를 제공합니다.</li>
    <ul>
      <li>대여 공간 조회 및 예약 서비스</li>
      <li>기타 회사가 추가 개발하거나 제휴 계약 등을 통해 회원에게 제공하는 일체의 서비스</li>
    </ul>
  <li>회사는 운영상, 기술상의 필요에 따라 제공하고 있는 서비스의 전부 또는 일부를 변경할 수 있습니다.</li>
</ol>

<h3>제5조(회원의 의무)</h3>
<p>회원은 다음 행위를 하여서는 안 됩니다.</p>
<ul>
  <li>허위 내용 등록</li>
  <li>타인의 정보 도용</li>
  <li>회사가 게시한 정보의 변경</li>
  <li>회사와 기타 제3자의 저작권 등 지적재산권에 대한 침해</li>
  <li>회사와 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위</li>
</ul>
`;

export const PRIVACY_POLICY_HTML = `

<style>
  li {
    margin-left: 20px;
  }
</style>

<br/>
  <h2 style="text-align: center;">개인정보 수집 및 이용 동의서</h2>
  <br/>
  <p>
    신한금융희망재단(이하 '회사'라고 합니다)은 개인정보보호법 등 관련 법령상의 개인정보 보호 규정을 준수하며 귀하의 개인정보보호에 최선을 다하고 있습니다.
    회사는 개인정보보호법에 근거하여 다음과 같은 내용으로 개인정보를 수집 및 처리하고자 합니다.
    다음의 내용을 자세히 읽어보시고 모든 내용을 이해하신 후에 동의 여부를 결정해주시기 바랍니다.
  </p>

  <br/>
  <h3>제1조(개인정보 수집 및 이용 목적)</h3>
  <p>이용자가 제공한 모든 정보는 다음의 목적을 위해 활용하며, 목적 이외의 용도로는 사용되지 않습니다.</p>
  <ul>
    <li>본인확인</li>
  </ul>

  <br/>
  <h3>제2조(개인정보 수집 및 이용 항목)</h3>
  <p>회사는 개인정보 수집 목적을 위하여 다음과 같은 정보를 수집합니다.</p>
  <ul>
    <li>성명, 이메일</li>
  </ul>

  <br/>
  <h3>제3조(개인정보 보유 및 이용 기간)</h3>
  <ol>
    <li>수집한 개인정보는 원칙적으로 서비스 이용계약(회원가입) 유지 기간 동안 보유 및 이용합니다.</li>
    <li>이용자가 회원 탈퇴 등 개인정보 수집 및 이용 동의를 철회하는 경우, 해당 개인정보는 지체 없이 파기합니다.</li>
    <li>다만, 관계 법령의 규정에 의하여 보존할 필요가 있는 경우, 회사는 해당 법령이 정한 기간 동안 개인정보를 보관할 수 있으며, 이 경우 보관되는 개인정보는 보존 목적 이외의 용도로 이용되지 않습니다.</li>
  </ol>

  <br/>
  <h3>제4조(동의 거부 권리 및 불이익)</h3>
  <p>
    귀하는 본 안내에 따른 개인정보 수집•이용에 대하여 동의를 거부할 권리가 있습니다.
    다만, 귀하가 개인정보 동의를 거부하시는 경우에 서비스 이용 중 일부 제한의 불이익이 발생할 수 있음을 알려드립니다.
  </p>

  <br/>
  <p><strong>본인은 위의 동의서 내용을 충분히 숙지하였으며, 위와 같이 개인정보를 수집·이용하는데 동의합니다.</strong></p>
`;
